
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	Объект.ПолученоСогласие = "1";
		
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуМаршрута()

  Карта  = Объект.БизнесПроцесс.ПолучитьОбъект().ПолучитьКартуМаршрута();
  

КонецПроцедуры // ОбновитьКартуМаршрута()


&НаКлиенте
Процедура ОткрытьКартуМаршрута(Команда)
	
	ОбновитьКартуМаршрута();
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Бизнес", Объект.БизнесПроцесс);
	ПараметрыОткрытия.Вставить("КартаМаршрутаБизнесПроцесса", Карта);
	
	ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.ФормаКартыМаршрута", ПараметрыОткрытия);
	
КонецПроцедуры 




