
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.АвторДокумента) тогда
		Объект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Номенклатура.Итог("Сумма");
	
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураТоварПриИзменении(Элемент)
	СтрокаТч = Элементы.Номенклатура.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТч.Товар) Тогда 
		СтрокаТч.Цена = РаботаСЦенами.ПолучитьЦенуПоставщиков(СтрокаТч.Товар, Объект.Дата, Объект.Поставщик)
	иначе 
		СтрокаТч.Цена = 0;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
		
	Для Каждого Тч Из Объект.Номенклатура Цикл 
		Тч.Цена  = РаботаСЦенами.ПолучитьЦенуПоставщиков(Тч.Товар, Объект.Дата, Объект.Поставщик);
		РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(Тч);	
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
		
КонецПроцедуры


