
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение(
		"Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.ФИОклиента.Видимость = Истина;
		Элементы.ДатаРожденияКлиента.Видимость = Истина;
		Элементы.Питомцы.Видимость = Истина;
		Элементы.Пол.Видимость = Истина;
		Элементы.Источник.Видимость = Истина;
		Элементы.Наименование.Видимость = Ложь;
		Элементы.ОсновнойДоговор.Видимость = Ложь;
	Иначе
		Элементы.ФИОклиента.Видимость = Ложь;
		Элементы.ДатаРожденияКлиента.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Ложь;
		Элементы.Пол.Видимость = Ложь;
		Элементы.Источник.Видимость = Ложь;
		Элементы.Наименование.Видимость = Истина;
		Элементы.ОсновнойДоговор.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


