
Процедура ПодтверждениеРегистрацииПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = РегистрацияПодтверждена;
КонецПроцедуры

Процедура ПометкаНаУдалениеПользователяОбработка(ТочкаМаршрутаБизнесПроцесса)
	
    Юзер = Справочники.Пользователи.НайтиПоНаименованию(Пользователь).ПолучитьОбъект();
	Юзер.УстановитьПометкуУдаления(Истина);

КонецПроцедуры

Процедура ПолучитьПодтверждениеРегистацииКлиентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл 
		ФормируемаяЗадача.Наименование = "Получить согласие клиента " + Пользователь.Наименование + " на регистрацию";
		ФормируемаяЗадача.Предмет = Пользователь;
		ФормируемаяЗадача.ОписаниеЗадачи = "Из мобильного приложения поступила заявка на регистрацию пользователя"
		"Необходимо созвониться с клиентом " + Пользователь + " по телефону: " + Пользователь.Клиент.КонтактныйТелефон +" и получить согласие на регистрацию,"
		"а так же дозаполнить карточку клиента - ФИО, ДатуРождения, сведения о питомцах и другие данные,"
		"которые клиент согласен пркдоставить.";
		ФормируемаяЗадача.Бизнес = Ссылка;
	КонецЦикла;
	
КонецПроцедуры


Процедура ПолучитьПодтверждениеРегистацииКлиентаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ДорегистрацияКлиента.ТочкиМаршрута.ПолучитьПодтверждениеРегистацииКлиента Тогда 
		Подтверждение = Задача.ПолученоСогласие;
		Если Подтверждение = "1" Тогда 
			РегистрацияПодтверждена = Истина;
		Иначе 
			РегистрацияПодтверждена = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

