//&НаКлиенте
//Процедура НачисленияВидРасчетаПриИзменении(Элемент)


//	ТекДанные = Элементы.Начисления.ТекущиеДанные;
//	ДатаНачисления = Объект.ПериодНачисления;
//	ПоказательРасчета = ПродажиСотрудников(ТекДанные.Сотрудник, ТекДанные.ВидРасчета, ДатаНачисления);
//	ТекДанные.ПоказательРасчета = ПоказательРасчета;

//КонецПроцедуры


//&НаСервереБезКонтекста
//Функция ПродажиСотрудников(Сотрудник, ВидРасчета, ПериодНачисления)
//	Если
//		ВидРасчета = ПланыВидовРасчета.Начисления.НайтиПоНаименованию("Премия процент от продаж")Тогда 
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ПродажиОбороты.Сотрудник КАК Сотрудник,
//		|	ПродажиОбороты.СуммаОборот КАК ПоказательРасчета
//		|ИЗ
//		|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , Сотрудник = &Сотрудник) КАК ПродажиОбороты";
//		
//		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодНачисления));
//		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодНачисления));
//		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		Если РезультатЗапроса.Пустой() Тогда 
//			Возврат 0;
//		КонецЕсли;
//		
//		Выборка = РезультатЗапроса.Выбрать();
//		Выборка.Следующий();
//		
//		Возврат Выборка.ПоказательРасчета;
//	Иначе 
//		Возврат Неопределено
//	КонецЕсли;


//КонецФункции // ПродажиСотрудников()

&НаСервере
Процедура ЗаполнитьДанныеПоПродажамНаСервере()
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОбороты.Сотрудник КАК Сотрудник,
		|	ПродажиОбороты.СуммаОборот КАК ПоказательРасчета
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПродажиОбороты";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ПериодНачисления));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодНачисления));
		
		РезультатЗапроса = Запрос.Выполнить();
		ТексСтр = РезультатЗапроса.Выгрузить();
		
		Объект.Начисления.Загрузить(ТексСтр);
		
	Для Каждого СтрокаТЧ из Объект.Начисления цикл
		СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.Начисления.НайтиПоНаименованию("Премия процент от продаж"); 
	КонецЦикла;
	
	Объект.Начисления.Сортировать("Сотрудник");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоПродажам(Команда)
	ЗаполнитьДанныеПоПродажамНаСервере();
КонецПроцедуры



