&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.Бессрочный Тогда
		Элементы.ДействуетДо.Видимость = Ложь;
		Если ЗначениеЗаполнено(Объект.ДействуетДо)Тогда 
			Объект.ДействуетДо = '0001,01,01';
		КонецЕсли;
	Иначе 
		Элементы.ДействуетДо.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры


&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	Если ЗначениеЗаполнено(Объект.НомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.НомерДоговора + " от " + 
		Формат(Объект.ДатаЗаключенияДоговора, "ДЛФ=Д") + " г.";
	ИначеЕсли ЗначениеЗаполнено(Объект.НомерДоговора)
		И НЕ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.НомерДоговора;
	Иначе 
		Объект.Наименование = " от" + Формат(Объект.ДатаЗаключенияДоговора, "ДЛФ=Д") + " г.";
	КонецЕсли;
КонецПроцедуры





