&НаСервере
Процедура УстановитьВидимость()

	Больничный = НЕ(Объект.Наименование = ПланыВидовРасчета.Начисления.Больничный);
	Оклад = НЕ(Объект.Наименование = ПланыВидовРасчета.Начисления.Оклад.Наименование);
	Элементы.ФормулаРасчета.Видимость = Больничный И Элементы.ФормулаРасчета.Видимость = Оклад;

КонецПроцедуры 


&НаСервере
Процедура ПриОткрытииНаСервере()
	УстановитьВидимость();
КонецПроцедуры 


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
                 




