
Процедура ОбработкаПроведения(Отказ, Режим)
	//КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаНоменклатура.Товар;
		Движение.Склад = СкладПолучатель;
		Движение.Количество = ТекСтрокаНоменклатура.Количество;
		
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаНоменклатура.Товар;
		Движение.Склад = СкладОтправитель;
		Движение.Количество = ТекСтрокаНоменклатура.Количество;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда 
		АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры
